Revit 2026 API

# KeyBasedTreeEntries Properties

---

The KeyBasedTreeEntries type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

KeyBasedTreeEntries Class

Autodesk.Revit.DB Namespace